"use client";
import { Stack, Typography } from "@mui/material";
import StarRateIcon from "@mui/icons-material/StarRate";

export default function FooterInfo1() {
  return (
    <Stack gap="24px" padding="0 120px" my="30px">
      <Stack direction="row" padding="16px 0">
        <StarRateIcon
          sx={{ color: "#18BA51", width: "32px", height: "32px" }}
        />
        <Typography fontSize="22px" fontWeight="700">
          Нууцлалын бодлого
        </Typography>
      </Stack>
      <Typography>
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        <br />
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
        <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
        <br /> Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
        албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
        үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино.
        <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
        <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
        <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
        <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
        <br /> Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
        албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
        үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино.
        <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
        <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
        <br /> Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
        албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
        үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино.
        <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
        <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
        <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
        <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
      </Typography>
    </Stack>
  );
}
